# Pandas
Reference: https://www.tutorialspoint.com/python_pandas/index.htm

**Use: Reading data from files into DataFrame objects, manipulating and reordering data.**

1. Fast and efficient *`DataFrame object`* with default and customized indexing.
2. Tools for *`loading data`* into in-memory data objects from different file formats.
3. Data alignment and integrated handling of *`missing data`*.
4. *`Reshaping`* and pivoting of date sets.
5. Label-based slicing, indexing and *`subsetting`* of large data sets.
6. *`Deleting or inserting`* columns.
7. *`Group by data`* for aggregation and transformations.
8. High performance *`merging and joining`* of data.

In [ ]:
import pandas as pd

## DataFrames
Reference: https://www.tutorialspoint.com/python_pandas/python_pandas_dataframe.htm


General 2D labeled, size-mutable (can be changed) tabular structure with potentially heterogeneously (different types) typed columns.

For example,

| Name | Age | Gender |  Rating |
| -----| ----| ------ | -------|
| Steve |	32 |	Male| 2.4 |
| Lia	| 28 |	Female| 3.6 |
| Vin	| 45|	Male| 4.2 |
| Katie	|38|	Female| 4.0 |

The table represents the data of a sales team of an organization with their overall performance rating. The data is represented in rows and columns. Each column represents an attribute and each row represents a person.

In [ ]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [ ]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [ ]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]} #dictionary, similar to maps/hashtables in c++
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [ ]:
df['Age']

rank1    28
rank2    34
rank3    29
rank4    42
Name: Age, dtype: int64

# Reading data
Reference: https://www.learndatasci.com/tutorials/python-pandas-tutorial-complete-introduction-for-beginners/

In [ ]:
covid = pd.read_csv('https://raw.githubusercontent.com/nytimes/covid-19-data/master/us-states.csv')
covid

             date          state  fips   cases  deaths
0      2020-01-21     Washington    53       1       0
1      2020-01-22     Washington    53       1       0
2      2020-01-23     Washington    53       1       0
3      2020-01-24       Illinois    17       1       0
4      2020-01-24     Washington    53       1       0
...           ...            ...   ...     ...     ...
11174  2020-09-21       Virginia    51  141138    3021
11175  2020-09-21     Washington    53   86803    2137
11176  2020-09-21  West Virginia    54   14171     312
11177  2020-09-21      Wisconsin    55  108656    1253
11178  2020-09-21        Wyoming    56    4944      49

[11179 rows x 5 columns]

In [ ]:
covid.head()

         date       state  fips  cases  deaths
0  2020-01-21  Washington    53      1       0
1  2020-01-22  Washington    53      1       0
2  2020-01-23  Washington    53      1       0
3  2020-01-24    Illinois    17      1       0
4  2020-01-24  Washington    53      1       0

In [ ]:
covid.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11179 entries, 0 to 11178
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    11179 non-null  object
 1   state   11179 non-null  object
 2   fips    11179 non-null  int64
 3   cases   11179 non-null  int64
 4   deaths  11179 non-null  int64
dtypes: int64(3), object(2)
memory usage: 436.8+ KB

In [ ]:
covid.set_index('date')

                    state  fips   cases  deaths
date
2020-01-21     Washington    53       1       0
2020-01-22     Washington    53       1       0
2020-01-23     Washington    53       1       0
2020-01-24       Illinois    17       1       0
2020-01-24     Washington    53       1       0
...                   ...   ...     ...     ...
2020-09-21       Virginia    51  141138    3021
2020-09-21     Washington    53   86803    2137
2020-09-21  West Virginia    54   14171     312
2020-09-21      Wisconsin    55  108656    1253
2020-09-21        Wyoming    56    4944      49

[11179 rows x 4 columns]

In [ ]:
covid.tail(8)

             date           state  fips   cases  deaths
11171  2020-09-21            Utah    49   64404     441
11172  2020-09-21         Vermont    50    1719      58
11173  2020-09-21  Virgin Islands    78    1269      19
11174  2020-09-21        Virginia    51  141138    3021
11175  2020-09-21      Washington    53   86803    2137
11176  2020-09-21   West Virginia    54   14171     312
11177  2020-09-21       Wisconsin    55  108656    1253
11178  2020-09-21         Wyoming    56    4944      49

# Handling missing data
Reference: https://www.tutorialspoint.com/python_pandas/python_pandas_missing_data.htm

- find missing values
- methods to fill missing values
- replacing anomalous values

In [ ]:
covid.isnull()

        date  state   fips  cases  deaths
0      False  False  False  False   False
1      False  False  False  False   False
2      False  False  False  False   False
3      False  False  False  False   False
4      False  False  False  False   False
...      ...    ...    ...    ...     ...
11174  False  False  False  False   False
11175  False  False  False  False   False
11176  False  False  False  False   False
11177  False  False  False  False   False
11178  False  False  False  False   False

[11179 rows x 5 columns]

In [ ]:
covid.isnull().any()

date      False
state     False
fips      False
cases     False
deaths    False
dtype: bool

In [ ]:
covid.fillna(0)

             date          state  fips   cases  deaths
0      2020-01-21     Washington    53       1       0
1      2020-01-22     Washington    53       1       0
2      2020-01-23     Washington    53       1       0
3      2020-01-24       Illinois    17       1       0
4      2020-01-24     Washington    53       1       0
...           ...            ...   ...     ...     ...
11174  2020-09-21       Virginia    51  141138    3021
11175  2020-09-21     Washington    53   86803    2137
11176  2020-09-21  West Virginia    54   14171     312
11177  2020-09-21      Wisconsin    55  108656    1253
11178  2020-09-21        Wyoming    56    4944      49

[11179 rows x 5 columns]

In [ ]:
covid.fillna(method='pad') #fill forward
covid.fillna(method='backfill') #fill backwards

             date          state  fips   cases  deaths
0      2020-01-21     Washington    53       1       0
1      2020-01-22     Washington    53       1       0
2      2020-01-23     Washington    53       1       0
3      2020-01-24       Illinois    17       1       0
4      2020-01-24     Washington    53       1       0
...           ...            ...   ...     ...     ...
11174  2020-09-21       Virginia    51  141138    3021
11175  2020-09-21     Washington    53   86803    2137
11176  2020-09-21  West Virginia    54   14171     312
11177  2020-09-21      Wisconsin    55  108656    1253
11178  2020-09-21        Wyoming    56    4944      49

[11179 rows x 5 columns]

In [ ]:
example = pd.DataFrame({'one':[10,20,30,40,50,2000], 'two':[1000,0,30,40,50,60]})
example

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60

In [ ]:
example.replace({1000:10,2000:60}) #replacing anomalous values

   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

# Selecting data from dataframe
Reference: https://www.tutorialspoint.com/python_pandas/python_pandas_indexing_and_selecting_data.htm

In [ ]:
#select all rows for a specific column
covid.loc[:,'state'] # format df.loc[rows, columns]

0           Washington
1           Washington
2           Washington
3             Illinois
4           Washington
             ...
11174         Virginia
11175       Washington
11176    West Virginia
11177        Wisconsin
11178          Wyoming
Name: state, Length: 11179, dtype: object

In [ ]:
covid.loc[100:500,['state', 'cases']]

                    state  cases
100             Wisconsin      1
101               Arizona      1
102            California      7
103              Illinois      2
104         Massachusetts      1
..                    ...    ...
496            California    202
497              Colorado     34
498           Connecticut      3
499              Delaware      1
500  District of Columbia     10

[401 rows x 2 columns]

# Groups
Used to prepare data for plots and analysis.

Reference: 

*  https://www.tutorialspoint.com/python_pandas/python_pandas_groupby.htm

In [ ]:
cases_by_state = covid[['state', 'cases']]
cases_by_state

               state   cases
0         Washington       1
1         Washington       1
2         Washington       1
3           Illinois       1
4         Washington       1
...              ...     ...
11174       Virginia  141138
11175     Washington   86803
11176  West Virginia   14171
11177      Wisconsin  108656
11178        Wyoming    4944

[11179 rows x 2 columns]

In [ ]:
cases_by_state.groupby('state')

In [ ]:
cases_by_state.groupby('state').groups

In [ ]:
cases_by_state.groupby('state').get_group('South Dakota')

              state  cases
486    South Dakota      5
530    South Dakota      8
577    South Dakota      8
628    South Dakota      9
679    South Dakota      9
...             ...    ...
10948  South Dakota  17686
11003  South Dakota  18075
11058  South Dakota  18444
11113  South Dakota  18696
11168  South Dakota  18869

[196 rows x 2 columns]

**Aggregated function**

An aggregated function returns a single aggregated value for each group. Once the group by object is created, several aggregation operations can be performed on the grouped data.

In [ ]:
import numpy as np

In [ ]:
cases_by_state.groupby('state').agg(np.sum).head(10)

                         cases
state
Alabama                9447356
Alaska                  412845
Arizona               16276443
Arkansas               4664981
California            54758559
Colorado               5976792
Connecticut            7164387
Delaware               1915621
District of Columbia   1638698
Florida               45786258

In [ ]:
cases_by_state.groupby('state').agg([np.sum, np.mean, np.std]).head(10)

                         cases
                           sum           mean            std
state
Alabama                9447356   48950.031088   48438.793576
Alaska                  412845    2128.067010    2409.353427
Arizona               16276443   67818.512500   81515.401548
Arkansas               4664981   23922.979487   24266.116452
California            54758559  227213.937759  266340.056195
Colorado               5976792   29735.283582   20056.183402
Connecticut            7164387   36183.772727   18300.698665
Delaware               1915621    9823.697436    6151.726517
District of Columbia   1638698    8234.663317    4898.832248
Florida               45786258  223347.600000  247292.915676

# Math and stats functions
Used to understand your data better.

References: 
* https://www.tutorialspoint.com/python_pandas/python_pandas_descriptive_statistics.htm
* https://www.tutorialspoint.com/python_pandas/python_pandas_statistical_functions.htm

In [ ]:
print("Max: ", covid['cases'].max())
print("Min: ", covid['cases'].min())
print("Sum: ", covid['cases'].sum())
print("Count: ", covid['cases'].count())
print("Median: ", covid['cases'].median())
print()
print("Summarize: \n", covid.describe()) #default numbers

Max:  792217
Min:  1
Sum:  545735015
Count:  11179
Median:  12004.0

Summarize:
                fips          cases        deaths
count  11179.000000   11179.000000  11179.000000
mean      31.838000   48817.874139   1862.135880
std       18.601262   98223.523365   4316.225627
min        1.000000       1.000000      0.000000
25%       17.000000    1396.000000     29.000000
50%       31.000000   12004.000000    359.000000
75%       46.000000   52612.500000   1675.000000
max       78.000000  792217.000000  32691.000000

# Other topics:

*  Sorting: https://www.tutorialspoint.com/python_pandas/python_pandas_sorting.htm
*  Joins: https://www.tutorialspoint.com/python_pandas/python_pandas_merging_joining.htm